#+title: Lab-book do Henrique
#+author: Henrique Silva
#+email: hcpsilva@inf.ufrgs.br
#+infojs_opt:
#+property: session *R*
#+property: cache yes
#+property: results graphics
#+property: exports both
#+property: tangle yes

Primeiramente, lab-book em org sim (jeito certo) e pau no cu do txt.

** Design

Seed randômica:

#+begin_src R :session :results value :exports results
floor(runif(1,1,99999))
#+end_src

#+RESULTS:
: 56753

Design:

#+begin_src R :session :results none
otim_1 = c("y", "n")
otim_2 = c("y", "n")
otim_3 = c("y", "n")
comp = c("-O0", "-O1", "-O2", "-O3")
cter = c("cycles", "L1-dcache-load-misses", "instructions", "l1d.replacement")

fac.design(
    nfactors=5,
    replications=30,
    repeat.only=FALSE,
    blocks=1,
    randomize=TRUE,
    seed=56753,
    factor.names=list(
      otimizacao_1=otim_1,
      otimizacao_2=otim_2,
      otimizacao_3=otim_3,
      counter=cter,
      compiler=comp)) %>%
  as_tibble %>%
  transmute(id = as.numeric(Blocks), otimizacao_1, otimizacao_2, otimizacao_3, counter, compiler) %>%
  write_delim("../experiments/runs.plan", delim=" ", col_names=FALSE)

# the space delimited file is to help with the posterior parsing in the shell
# script
#+end_src

